Repository: James-Edward-Ntigwimbugwa/medication-reminder-app
Catalog: lib/l10n/app_*.arb
Languages: sw

source: Settings
sw: Mipangilio

source: Language
sw: Lugha

# selectLanguage
source: Select your preferred language
sw: Chagua lugha unayopendelea

source: English
sw: Kiingereza

source: Swahili
sw: Kiswahili

source: Add Medication
sw: sajili doziyako

source: Medications
sw: Dozi zangu

source: Communication
sw: Mawasiliano

source: Permissions Required
sw: Ruhusa Zinahitajika

# permissionExplanation
source: We need permissions to show reminders.
sw: Tunahitaji ruhusa ili kuonyesha vikumbusho vya dawa.

# exactAlarmReason
source: Used to trigger medication reminders at exact times.
sw: Inahitajika kuwasha vikumbusho kwa wakati sahihi.

# missedReminderWarning
source: Missing this may cause missed medication alerts.
sw: Ukikosa ruhusa hii unaweza kukosa vikumbusho vya dawa.

source: Later
sw: Baadaye

source: Grant Permissions
sw: Toa Ruhusa

source: All permissions granted!
sw: Ruhusa zote zimetolewa!

source: Permission denied
sw: Ruhusa imekataliwa

# permissionBanner
source: Some permissions are missing.
sw: Ruhusa zingine bado hazijatolewa.

source: Fix
sw: Rekebisha

source: Health Info
sw: Taarifa za Afya

source: Chat
sw: Mawasiliano

source: Save Medication
sw: sevu

source: Current Time
sw: Muda wa Sasa

# setReminders
source: Set your medication reminders
sw: Weka vikumbusho vya dawa

source: Medication Name
sw: Jina la Dawa

# exampleMedication
source: e.g. Amoxicillin
sw: mf. Amoxicillin

# medicationUnit
source: Unit (mg/ml/tablets)
sw: Kiasi (mg/ml/vidonge)

# exampleUnit
source: e.g. 500mg
sw: mf. 500mg

source: Frequency
sw: Marudio

source: Once Daily
sw: Mara Moja kwa Siku

source: Twice Daily
sw: Mara Mbili kwa Siku

source: Three Times Daily
sw: Mara Tatu kwa Siku

source: Custom
sw: Chaguo Maalum

source: Reminder Times
sw: Nyakati za Vikumbusho

source: Add Time
sw: Ongeza Muda

# noReminderSet
source: No reminder times set
sw: Hakuna muda wa kumbusho uliowekwa

source: Reminder {number}
sw: Kumbusho {number}

# incompleteFields
source: Please complete all fields
sw: Tafadhali jaza sehemu zote

# medicationSaved
source: Medication saved successfully
sw: Dawa imehifadhiwa kwa mafanikio

# saveFailed
source: Failed to save medication
sw: Imeshindikana kuhifadhi dawa

source: Health Information Hub
sw: jifunze JuaAfyaYako

# juaAfyaYako
source: Know Your Health
sw: Jua Afya Yako

source: Common Health Tips
sw: Vidokezo vya Kawaida vya Afya

# exploreDailyPractices
source: Explore daily practices to maintain a healthy lifestyle.
sw: Chunguza mazoea ya kila siku ili kudumisha maisha yenye afya.

source: Learn More
sw: Jifunze Zaidi

# lisheBora
source: Balanced Nutrition
sw: Lishe Bora

source: Nutrition
sw: Lishe

# understandNutritionImportance
source: Understand the importance of balanced nutrition.
sw: Elewa umuhimu wa lishe bora.

source: Mental Health
sw: Afya ya Akili

# mentalWellBeing
source: Learn about mental well-being and stress management.
sw: Jifunze kuhusu ustawi wa akili na usimamizi wa msongo wa mawazo.

source: Maternal & Child Health
sw: Afya ya Mama na Mtoto

# maternalChildGuidance
source: Vital guidance for pregnant mothers and children.
sw: Mwongozo muhimu kwa wamama wajawazito na watoto.

source: Disease Prevention
sw: Kuzuia Magonjwa

# protectFromDiseases
source: Protect yourself from malaria, HIV, TB and more.
sw: Jikinga na malaria, VVU, kifua kikuu na zaidi.

source: Chat with Health Assistant
sw: Ongea na Msaidizi wa Afya

source: Type your message...
sw: Andika ujumbe wako...

# createAccount
source: Create Your Account
sw: Fungua Akaunti Yako

# registerToManageProviders
source: Register to manage your healthcare providers
sw: Jisajili ili kudhibiti watoa huduma wako wa afya

source: Full Name
sw: Jina Kamili

source: Email Address
sw: Anwani ya Barua Pepe

# passwordMin6
source: Password (min 6 characters)
sw: Nenosiri (angalau herufi 6)

source: Welcome Back
sw: Karibu Tena

# loginToAccessProviders
source: Login to access your healthcare providers
sw: Ingia ili upate watoa huduma wako wa afya

source: Password
sw: Nenosiri

source: Login
sw: Ingia

# alreadyHaveAccount
source: Already have an account?
sw: Tayari una akaunti?

# noAccount
source: Don't have an account?
sw: Huna akaunti?

source: Register
sw: Jisajili

source: Hello
sw: Habari

source: Email
sw: Barua Pepe

# yourProviders
source: Your Healthcare Providers
sw: Watoa Huduma Wako wa Afya

# noProvidersYet
source: No providers registered yet
sw: Bado hakuna watoa huduma waliiosajiliwa

# addFirstProvider
source: Add your first healthcare provider to get started
sw: Ongeza mtoa huduma wako wa afya wa kwanza ili uanze

source: Add Provider
sw: Ongeza Mtoa Huduma

source: Add New Provider
sw: Ongeza Mtoa Huduma Mpya

source: Category
sw: Kategoria

source: Edit
sw: Hariri

source: Delete
sw: Futa

# emptyName
source: Please enter your full name
sw: Tafadhali weka jina lako kamili

# invalidEmail
source: Please enter a valid email address
sw: Tafadhali weka anwani ya barua pepe sahihi

# shortPassword
source: Password must be at least 6 characters long
sw: Nenosiri linapaswa kuwa na angalau herufi 6

# accountCreated
source: Account created successfully!
sw: Akaunti imefunguliwa kwa mafanikio!

# invalidCredentials
source: Invalid email or password
sw: Barua pepe au nenosiri si sahihi

# welcomeBackMessage
source: Welcome back!
sw: Karibu tena!

# loggedOut
source: Logged out successfully
sw: Umetoka nje kwa mafanikio

source: Provider Name
sw: Jina la Mtoa Huduma

# providerCategory
source: Category (e.g., Doctor, Dentist)
sw: Kategoria (mfano, Daktari, Daktari wa Meno)

# whatsappNumber
source: WhatsApp Number (e.g., +1234567890)
sw: Namba ya WhatsApp (mfano, +1234567890)

source: Cancel
sw: Ghairi

source: Update
sw: Sasisha

source: Save
sw: Hifadhi

# fillAllFields
source: Please fill all fields
sw: Tafadhali jaza sehemu zote

# invalidWhatsApp
source: Please enter a valid WhatsApp number (e.g., +1234567890)
sw: Tafadhali weka namba ya WhatsApp sahihi (mfano, +1234567890)

# providerUpdated
source: Provider updated successfully!
sw: Mtoa huduma amesasishwa kwa mafanikio!

# providerAdded
source: Provider added successfully!
sw: Mtoa huduma ameongezwa kwa mafanikio!

source: Delete Provider
sw: Futa Mtoa Huduma

# confirmDeleteProvider
source: Are you sure you want to delete {providerName}?
sw: Je, una uhakika unataka kumudu {providerName}?

# providerDeleted
source: Provider deleted successfully
sw: Mtoa huduma amefutwa kwa mafanikio

# failedEmail
source: Failed to open email app for {email}. Please open your email app and send to {email}.
sw: Imeshindikana kufungua programu ya barua pepe kwa {email}. Tafadhali fungua programu yako ya barua pepe na tuma kwa {email}.

# failedWhatsApp
source: Failed to open WhatsApp for {phone}. Please open WhatsApp and message {phone}.
sw: Imeshindikana kufungua WhatsApp kwa {phone}. Tafadhali fungua WhatsApp na tuma ujumbe kwa {phone}.

# userDataRecovered
source: User data recovered from backup
sw: Data ya mtumiaji imerejeshwa kutoka kwenye hifadhi

# failedDecodeUserBackup
source: Failed to decode user backup
sw: Imeshindikana kusimbua hifadhi ya mtumiaji

# failedRecoverUserData
source: Failed to recover user data
sw: Imeshindikana kurejesha data ya mtumiaji

source: Error saving user data
sw: Hitilafu wakati wa kuhifadhi data ya mtumiaji

# failedSaveProviders
source: Failed to save providers
sw: Imeshindikana kuhifadhi watoa huduma

# providersRecovered
source: Providers recovered from backup
sw: Watoa huduma wamerejeshwa kutoka kwenye hifadhi

# clearedInvalidBackup
source: Cleared invalid provider backup
sw: Hifadhi isiyo sahihi ya watoa huduma imefutwa

# failedDecodeProviderBackup
source: Failed to decode provider backup, cleared corrupted data
sw: Imeshindikana kusimbua hifadhi ya watoa huduma, data iliyoharibika imefutwa

# noProviderBackup
source: No provider backup available
sw: Hakuna hifadhi ya watoa huduma inayopatikana

# failedRecoverProviders
source: Failed to recover providers
sw: Imeshindikana kurejesha watoa huduma

source: Debug Storage
sw: Hifadhi ya Uchunguzi

source: Providers Count
sw: Idadi ya Watoa Huduma

source: Clear corrupted backup?
sw: Futa hifadhi iliyoharibika?

source: Clear
sw: Futa

source: Cleared backup data
sw: Data ya hifadhi imefutwa

# failedDebugStorage
source: Failed to debug storage
sw: Imeshindikana kuchunguza hifadhi

# failedCreateBackup
source: Failed to create backup
sw: Imeshindikana kuunda hifadhi

source: Logout
sw: Toka

source: Recover Providers
sw: Rejesha Watoa Huduma

# debugStorageAction
source: Debug Storage
sw: Chunguza Hifadhi

# appBarTitle
source: DoziYangu-support
sw: DoziYangu-msaada

# registerDescription
source: Register to manage your healthcare providers
sw: Jisajili ili kudhibiti watoa huduma wako wa afya

# loginDescription
source: Login to access your healthcare providers
sw: Ingia ili upate watoa huduma wako wa afya

# debugStorageTitle
source: Debug Storage
sw: Hakuna Hifadhi

# providersTitle
source: Your Healthcare Providers
sw: Watoa Huduma Wako wa Afya

# noProviders
source: No providers registered yet
sw: Bado hakuna watoa huduma walisajiliwa

# addProviderPrompt
source: Add your first healthcare provider to get started
sw: Ongeza mtoa huduma wako wa kwanza ili kuanza

# emailAction
source: Email
sw: Barua Pepe

# deleteConfirmation
source: Are you sure you want to delete {provider}?
sw: Una uhakika unataka kufuta {provider}?

# errorEmptyName
source: Please enter your full name
sw: Tafadhali ingiza jina lako kamili

# errorInvalidEmail
source: Please enter a valid email address
sw: Tafadhali ingiza barua pepe sahihi

# errorShortPassword
source: Password must be at least 6 characters long
sw: Nenosiri lazima liwe na angalau herufi 6

# errorInvalidCredentials
source: Invalid email or password
sw: Barua pepe au nenosiri lisilo sahihi

# errorFillFields
source: Please fill all fields
sw: Tafadhali jaza sehemu zote

# errorInvalidWhatsApp
source: Please enter a valid WhatsApp number (e.g., +1234567890)
sw: Tafadhali ingiza nambari ya WhatsApp sahihi (mfano, +1234567890)

# clearedBackup
source: Cleared invalid provider backup
sw: Hifadhi isiyo sahihi imefutwa

# errorCreateBackup
source: Failed to create backup
sw: Imeshindwa kuunda hifadhi

# errorEmailLaunch
source: Failed to open email app for {toEmail}. Please open your email app and send to {toEmail}.
sw: Imeshindwa kufungua programu ya barua pepe kwa {toEmail}. Tafadhali fungua programu yako ya barua pepe na tuma kwa {toEmail}.

# errorWhatsAppLaunch
source: Failed to open WhatsApp for {phone}. Please open WhatsApp and message {phone}.
sw: Imeshindwa kufungua WhatsApp kwa {phone}. Tafadhali fungua WhatsApp na utume ujumbe kwa {phone}.

# clearCorrupted
source: Clear corrupted backup?
sw: Futa hifadhi iliyoharibika?

# errorDebugStorage
source: Failed to debug storage
sw: Imeshindwa kuhakiki hifadhi
